================================================================================
line continuation on setting values
================================================================================

[section]
multi = foo? \
bar ; not comment \
[not section] \
 can have space \
still = value

--------------------------------------------------------------------------------

(document
  (section
    (section_name
      (text))
    (setting
      (setting_name)
      (setting_value
        (setting_text)
        (setting_value_cont
          (setting_text_cont))
        (setting_value_cont
          (setting_text_cont))
        (setting_value_cont
          (setting_text_cont))
        (setting_value_cont
          (setting_text_cont))))))

================================================================================
comments in continued lines
================================================================================

setting = value1 \
# this line is comment
; also comment
value2 \
  # comment with indent
value3 

--------------------------------------------------------------------------------

(document
  (unnamed_section
    (setting
      (setting_name)
      (setting_value
        (setting_text)
        (setting_value_cont
          (comment
            (text))
          (comment
            (text))
          (setting_text_cont))
        (setting_value_cont
          (comment
            (text))
          (setting_text_cont))))))

================================================================================
empty continued lines
================================================================================

setting = value1 \
\
value2 \
\
\
value3 \
# comment
\
; also comment
value4 
setting2 = ended next line \

foo = 3

--------------------------------------------------------------------------------

(document
  (unnamed_section
    (setting
      (setting_name)
      (setting_value
        (setting_text)
        (setting_value_cont)
        (setting_value_cont
          (setting_text_cont))
        (setting_value_cont)
        (setting_value_cont)
        (setting_value_cont
          (setting_text_cont))
        (setting_value_cont)
        (comment
          (text))
        (setting_value_cont
          (comment
            (text))
          (setting_text_cont))))
    (setting
      (setting_name)
      (setting_value
        (setting_text)
        (setting_value_cont)))
    (setting
      (setting_name)
      (setting_value
        (setting_text)))))

===========================================
escaped sequences
===========================================

[section]
single = escaped backslash \\
multi = foo \
bar \\
multi = esc before line cont \\\
other esc seqs \t\ \ 
esc\\ in keys \\= 1
[esc seq\tin section\\]

--------------------------------------------

(document
  (section
    (section_name
      (text))
    (setting
      (setting_name)
      (setting_value
        (setting_text)))
    (setting
      (setting_name)
      (setting_value
        (setting_text)
        (setting_value_cont
          (setting_text_cont))))
    (setting
      (setting_name)
      (setting_value
        (setting_text)
        (setting_value_cont
          (setting_text_cont))))
    (setting
      (setting_name)
      (setting_value
        (setting_text))))
  (section
    (section_name
      (text))))

================================================================================
invalid line continuation locations
================================================================================

[section]
illegal line cont\
inuation = 1
legal = 2
illegal \\\
name = 3
legal escaped\t \\ name = 4
legal \\= 5
[illegal on \
section]
foo = bar

[foo]
bar = baz
[illegal after section] \
foo = bar

--------------------------------------------------------------------------------

(document
  (section
    (section_name
      (text))
    (setting
      (setting_name)
      (ERROR
        (setting_name))
      (setting_value
        (setting_text)))
    (setting
      (setting_name)
      (setting_value
        (setting_text)))
    (setting
      (setting_name)
      (ERROR
        (setting_name))
      (setting_value
        (setting_text)))
    (setting
      (setting_name)
      (setting_value
        (setting_text)))
    (setting
      (setting_name)
      (setting_value
        (setting_text))))
  (section
    (section_name
      (text)
      (ERROR
        (setting_name)))
    (setting
      (setting_name)
      (setting_value
        (setting_text))))
  (section
    (section_name
      (text))
    (setting
      (setting_name)
      (setting_value
        (setting_text))))
  (ERROR
    (text)
    (setting_name)
    (setting_name)))
